<template>
  <div class="single-post-page">
    <article class="article">
      <header class="article-header">
        <img :src="img1" alt="" height="536px" width="784px" class="article-img">
      </header>
      <section>
        <h2 class="article-title">Сучасні блоги та блогери</h2>
        <div class="article-text">
          <p>Що таке сучасні блоги та блогери? Чому блоги стали настільки читані, а блогери настільки популярні?
             Мене попросили написати рамкову статтю для нововідкритого розділу блогів і от що з того вийшло.</p>
          <section>
            <h3>Перевага блогерів над журналістами</h3>
            <p>Традиційні газети та журнали, а також гідбридні телеканали продукують здебільшого смерть знаного автора. Не автора взагалі, а знаного автора.</p>
            <p>Вочевидь це зумовлене високим порогом входження на ринок авторської журналістики.</p>
            <p>Відомі автори, в які ті чи інші видання та телеканали вкладають капітал (промоція, реклама, юридичний захист), по мірі зростання їх популярності починають складати значну частину капіталізації видання (телеканалу). Оскільки видання (телеканал) не може собі дозволити зниження капіталізації, то орієнтує такого автора на змістовні рамки видання (телеканалу) – його редакційну політику, порядок денний, тематику і т.д.</p>
            <p>Так відомий автор починає залежати від видання (телеканалу), а видання (телеканал) починає залежати від нього. Позиція автора все частіше починає відображати позицію видання (телеканалу), до автора все частіше звертаються з проханням про ті чи інші політичні послуги від імені впливових щодо видання (телеканалу) осіб. Забрана у автора свобода рано чи пізно приводить до зниження цікавості до автора. Відтак або автор це відчуває і йде з видання (телеканалу), або його примусово замінюють на іншого, або популярність видання (телеканалу) загалом падає.</p>
            <p>Блог дозволяє будь-кому спробувати свої сили у якості вільного автора. Такі можливості дає Інтернет, який значно знизив поріг входження на ринок авторської журналістики. Схема "блог+обговорення блогу в соціальних мережах" виявилася надзвичайно ефективною для змістовної комунікації на сучасному етапі.</p>
            <p>Все влаштовано набагато простіше, ніж у традиційному виданні. Читач в Інтернеті знаходить свого чи своїх блогерів незалежно від їх приналежності до якого-небудь видання (телеканалу), бо видання як такого власне немає: Інтернет і є фактично видання і телеканал.</p>
            <p>Водночас блогер з самого початку має те, чого ніколи не мав журналіст будь-якого видання (телеканалу) – незалежність та можливість самому вибирати теми, стиль, способи подачі та самопрезентації.</p>
          </section>
          <section>
            <h3>Перевага блогерів над журналістами</h3>
            <p>Традиційні газети та журнали, а також гідбридні телеканали продукують здебільшого смерть знаного автора. Не автора взагалі, а знаного автора.</p>
            <p>Вочевидь це зумовлене високим порогом входження на ринок авторської журналістики.</p>
            <p>Відомі автори, в які ті чи інші видання та телеканали вкладають капітал (промоція, реклама, юридичний захист), по мірі зростання їх популярності починають складати значну частину капіталізації видання (телеканалу). Оскільки видання (телеканал) не може собі дозволити зниження капіталізації, то орієнтує такого автора на змістовні рамки видання (телеканалу) – його редакційну політику, порядок денний, тематику і т.д.</p>
            <p>Так відомий автор починає залежати від видання (телеканалу), а видання (телеканал) починає залежати від нього. Позиція автора все частіше починає відображати позицію видання (телеканалу), до автора все частіше звертаються з проханням про ті чи інші політичні послуги від імені впливових щодо видання (телеканалу) осіб. Забрана у автора свобода рано чи пізно приводить до зниження цікавості до автора. Відтак або автор це відчуває і йде з видання (телеканалу), або його примусово замінюють на іншого, або популярність видання (телеканалу) загалом падає.</p>
          </section>
        </div>
        <div class="article-bottom-line">
          <div class="article-date">
            <span>20.11.2020</span>
          </div>
          <div class="article-btn-right">
            <router-link :to="{ name: 'Home' }" class="btn-text">На головну</router-link>
          </div>
        </div>
      </section>
    </article>
  </div>
</template>

<script>
import img1 from '@/assets/images/1.jpg'

export default {
  name: 'Home',
  data () {
    return {
      img1
    }
  }
}
</script>

<style lang="sass">
  .single-post-page
    width: 100%
    .article
      margin-bottom: 30px
      .article-header
        margin-bottom: 16px
        .article-img
          max-width: 100%
          height: auto
          width: auto
      .article-title
        font-size: 32px
        margin-bottom: 12px
      .article-text
        font-size: 18px
        margin-bottom: 25px
        p
          display: block
          padding-bottom: 12px
          line-height: 24px
        h3
          padding-bottom: 6px
      .article-bottom-line
        display: flex
        justify-content: space-between
        align-items: center
        .article-date
          font-style: italic
          font-size: 18px
          color: #373737
        .article-btn-right
          .btn-text
            text-transform: lowercase
            text-decoration: none
            font-style: italic
            margin-right: 5px
            color: #B00E0E
            &:hover
              text-decoration: underline
</style>
