import imgArt1 from '@/assets/images/city2.jpg'
import imgArt1w from '@/assets/images/city2.webp'
import imgArt2 from '@/assets/images/art2.jpg'
import imgArt2w from '@/assets/images/art2.webp'

const articles = [
  {
    id: 1,
    title: 'Віртуальна бізнес-країна зі спеціальним правовим режимом для ІТ-компаній Дія.City запрацює у першій половині 2021 року',
    shortText: '«Наша амбітна мета — перше півріччя 2021 року, коли проєкт Дія.City запрацює, і будуть перші резиденти. Я вірю, що це прискорить у геометричній прогресії розвиток ІТ та креативної індустрії',
    text: [
      {
        content: [
          { sectionTitle: 'noneTitle' },
          { p: 'Про це повідомив віцепрем’єр-міністр – міністр цифрової трансформації Михайло Федоров у інтерв’ю НВ, повідомляє пресслужба Мінцифри в Телеграмі.' },
          { p: '«Наша амбітна мета — перше півріччя 2021 року, коли проєкт Дія.City запрацює, і будуть перші резиденти. Я вірю, що це прискорить у геометричній прогресії розвиток ІТ та креативної індустрії, а потім ми це масштабуємо на всю країну. Тобто глобальна наша мета — це зміна податкової системи в усій країні», – заявив Федоров.' },
          { p: 'Дія.City — це спеціальний правовий режим для IT-компаній. У Верховній Раді вже зареєстровано законопроєкти, що дозволять запустити Дія.City. ' },
          { p: 'За словами Михайла Федорова, Дія.City – це пілот для перезапуску всієї економіки України. За кілька років, після переведення усіх державних послуг в онлайн, таку податкову модель можна буде адаптувати на всю країну. ' },
          { p: 'Зокрема, за 5 років Дія.City дозволить збільшити об’єм ринку IT вдвічі — до $11,8 млрд, а кількість робочих місць до 450 тисяч.' },
          { p: 'Серед основних критеріїв вступу до Дія.City: ' },
          {
            ul: [
              'компанії мають належати за видом економічної діяльності до IT і креативної індустрії;',
              'штат компанії повинен налічувати мінімум дев’ять співробітників;',
              'середня заробітна плата має становити 1200 євро.'
            ]
          }
        ]
      }
    ],
    urlImage: imgArt1,
    urlImageWebp: imgArt1w,
    date: '25.11.2020'
  },
  {
    id: 2,
    title: 'Как хобби превратилось в работу мечты',
    shortText: 'Постараться побыстей определиться с направлением в вебе... если мы говорим о веб-разработке. Так, как у меня ушло много времени на это. Я не мог изначально определиться чем заниматься',
    text: [
      {
        content: [
          { sectionTitle: 'noneTitle' },
          { p: '<b>Сергей Тарасов</b> – программист из Кривого Рога, который изменил свою жизнь. Он идет к своей мечте быть лучшим в своём деле. В интервью для <strong>BlogDl</strong> он рассказал о своих планах на будущее и дал несколько советов начинающим программистам.' },
          { p: '<i><b>Где родился, в какой школе/ВУЗ-е учился:</b></i>' },
          { p: 'Родился в Кривом Роге. Учился в обычной школе Кривого Рога. Закончил Криворожский технический университет по специальности "Автомобили и автомобильное хозяйство", в последствии там же получил степень магистра в области инженерной механики.' },
          { p: '<i><b>Первая и последующие работы:</b></i>' },
          { p: 'Работал года три по специальности в автотранспортном цехе "Криворожстали". Уже тогда понял, что это мне не сильно нравится. Позже лет восемь работал в разных коммерческих компаниях. И эта работа тоже не приносила особого удовольствия.' },
          { p: '<i><b>Откуда узнал о программировании:</b></i>' },
          { p: 'Четыре года назад случайно в ютубе посмотрел какое-то видео о создании сайтов... и решил попробовать. Начал изучать основы программирования. Потом правда долого не мог определиться с выбором технологий с помощью которых можно делать сайты.' },
          { p: '<i><b>Какие ютуб-каналы о программировании смотришь:</b></i>' },
          { p: 'В действительнсти их очень много и они у меня постоянно меняются в зависмости от того, что я в данный момент изучаю. Тем не мение есть два канала которые я регулярно просматриваю.' },
          { p: 'Это каналы Дмитрия Лаврика и Владилена Минина. Просто сейчас я больше информации ищу в официалоной документации. Ну и я всё же уже определился со своим направлением в вебе.' },
          { p: 'Есть каналы, которые не связаны с программированием, однако я их тоже просматриваю. Например, канал Алексея Бычкова по веб-дизайну. Так как оказалось, что веб-разработчик отчасти должен быть и веб-дизайнером (и наоборот).' },
          { p: '<i><b>Какие книги о программировании читаешь:</b></i>' },
          { p: 'Книги по программированию практически не читаю. Как по мне, то лучше всё же официальные доки. Книги очень быстро устаревают. В самом начале конечно читал, но это были книги на какие-то базовые темы.' },
          { p: '<i><b>С чего начинал:</b></i>' },
          { p: 'Ой, начинал с попытки написать сайт на языке Pyton используя фреймворк Django. Так, как у кого-то на канале было видео о том как это всё легко и просто. Но очень быстро понял, что без хотя бы базовых знаний программирования это всё не так.' },
          { p: 'Поэтому сперва научился верстать сайты, а для этого нужно было разобраться с HTML (стандартизированный язык разметки веб-страниц) и CSS (язык описания внешнего вида документа). Это оказалось ещё не программирование, HTML и CSS тяжело назвать языками программирование.' },
          { p: 'Ну, а дальше без вариантов... Javascript. Так как только этот язык работает в браузерах. Именно благодаря JS мы взаимодействуем с веб-сайтом (веб-приложением). Т.е. весь интерактив который вы видите в браузере - это js (ну почти).' },
          { p: '<i><b>Какие языки программирования изучаешь:</b></i>' },
          { p: 'В данный момент мой основной язык программировани это - javascript. Точнее в своей работе я использую JS-фреймворк Vue.js(Nuxt.js). Но также изучал PHP, знакомился с Pyton и Java.' },
          { p: '<i><b>Что можешь посоветовать начинающим программистам:</b></i>' },
          { p: 'Постараться побыстей определиться с направлением в вебе... если мы говорим о веб-разработке. Так, как у меня ушло много времени на это. Я не мог изначально определиться чем заниматься фронтендом или бэкендом. Ну это если совсем грубо. Так как каждое направление требует изучение разных технологий, языков, фрейворков и т.д. И зачастую, пристапая  изучению какой-то новой технологии понимаешь, что нужно разобраться ещё с какой-то темой, а она требует знания ещё чего-то... и это нарастает как снежный ком. И при этом очень сложно понять понадобиться это тебе в дальнейшем или нет. А время на это нужно потратить.' },
          { p: 'Поэтому чтобы этот период самоопределения прошёл быстрее желательно найти какого-то ментора. Т.е. нужен человек, который будет подсказывать какие технологии программирования изучать, в жём нужно разобраться, а что можно оставить на-потом или вообще это не нужно...' },
          { p: 'Для получения совсем базовых знаний подойдут и бесплатные уроки на ютубе. Но нужно понимать, что там мало реальных кейсов, которые можно потом использовать в работе. А так же там огромное количество видео где, скажем прямо, вообще учать делать неправильно. Поэтому лучше конечно пройти платный курс. Мне платные курсы помогли научиться писать более красивый и правильный код.' },
          { p: '<i><b>Планы на будущее:</b></i>' },
          { p: 'Продолжить развиваться в этой сфере. Углубиться в изучение бэкенда, т.е. серверной части веб-приложений. Так, как моих знаний в этой области уже недостаточно что бы делать серьёзные приложения.' }
        ]
      }
    ],
    urlImage: imgArt2,
    urlImageWebp: imgArt2w,
    date: '24.11.2020'
  }
]

export { articles }
