import imgArt1 from '@/assets/images/city2.jpg'
import imgArt1w from '@/assets/images/city2.webp'
import imgArt2 from '@/assets/images/art2.jpg'
import imgArt2w from '@/assets/images/art2.webp'
import imgArt3 from '@/assets/images/art3.jpg'
import imgArt3w from '@/assets/images/art3.webp'

const articles = [
  {
    id: 1,
    title: 'Віртуальна бізнес-країна зі спеціальним правовим режимом для ІТ-компаній Дія.City запрацює у першій половині 2021 року',
    shortText: '«Наша амбітна мета — перше півріччя 2021 року, коли проєкт Дія.City запрацює, і будуть перші резиденти. Я вірю, що це прискорить у геометричній прогресії розвиток ІТ та креативної індустрії',
    text: [
      {
        content: [
          { sectionTitle: 'noneTitle' },
          { p: 'Про це повідомив віцепрем’єр-міністр – міністр цифрової трансформації Михайло Федоров у інтерв’ю НВ, повідомляє пресслужба Мінцифри в Телеграмі.' },
          { p: '«Наша амбітна мета — перше півріччя 2021 року, коли проєкт Дія.City запрацює, і будуть перші резиденти. Я вірю, що це прискорить у геометричній прогресії розвиток ІТ та креативної індустрії, а потім ми це масштабуємо на всю країну. Тобто глобальна наша мета — це зміна податкової системи в усій країні», – заявив Федоров.' },
          { p: 'Дія.City — це спеціальний правовий режим для IT-компаній. У Верховній Раді вже зареєстровано законопроєкти, що дозволять запустити Дія.City. ' },
          { p: 'За словами Михайла Федорова, Дія.City – це пілот для перезапуску всієї економіки України. За кілька років, після переведення усіх державних послуг в онлайн, таку податкову модель можна буде адаптувати на всю країну. ' },
          { p: 'Зокрема, за 5 років Дія.City дозволить збільшити об’єм ринку IT вдвічі — до $11,8 млрд, а кількість робочих місць до 450 тисяч.' },
          { p: 'Серед основних критеріїв вступу до Дія.City: ' },
          {
            ul: [
              'компанії мають належати за видом економічної діяльності до IT і креативної індустрії;',
              'штат компанії повинен налічувати мінімум дев’ять співробітників;',
              'середня заробітна плата має становити 1200 євро.'
            ]
          }
        ]
      }
    ],
    urlImage: imgArt1,
    urlImageWebp: imgArt1w,
    date: '20.11.2020'
  },
  {
    id: 2,
    title: 'Віртуальна бізнес-країна зі спеціальним правовим режимом для ІТ-компаній Дія.City запрацює у першій половині 2021 року',
    shortText: '«Наша амбітна мета — перше півріччя 2021 року, коли проєкт Дія.City запрацює, і будуть перші резиденти. Я вірю, що це прискорить у геометричній прогресії розвиток ІТ та креативної індустрії',
    text: [
      {
        content: [
          { sectionTitle: 'noneTitle' },
          { p: 'Про це повідомив віцепрем’єр-міністр – міністр цифрової трансформації Михайло Федоров у інтерв’ю НВ, повідомляє пресслужба Мінцифри в Телеграмі.' },
          { p: '«Наша амбітна мета — перше півріччя 2021 року, коли проєкт Дія.City запрацює, і будуть перші резиденти. Я вірю, що це прискорить у геометричній прогресії розвиток ІТ та креативної індустрії, а потім ми це масштабуємо на всю країну. Тобто глобальна наша мета — це зміна податкової системи в усій країні», – заявив Федоров.' },
          { p: 'Дія.City — це спеціальний правовий режим для IT-компаній. У Верховній Раді вже зареєстровано законопроєкти, що дозволять запустити Дія.City. ' },
          { p: 'За словами Михайла Федорова, Дія.City – це пілот для перезапуску всієї економіки України. За кілька років, після переведення усіх державних послуг в онлайн, таку податкову модель можна буде адаптувати на всю країну. ' },
          { p: 'Зокрема, за 5 років Дія.City дозволить збільшити об’єм ринку IT вдвічі — до $11,8 млрд, а кількість робочих місць до 450 тисяч.' },
          { p: 'Серед основних критеріїв вступу до Дія.City: ' },
          {
            ul: [
              'компанії мають належати за видом економічної діяльності до IT і креативної індустрії;',
              'штат компанії повинен налічувати мінімум дев’ять співробітників;',
              'середня заробітна плата має становити 1200 євро.'
            ]
          }
        ]
      }
    ],
    urlImage: imgArt2,
    urlImageWebp: imgArt2w,
    date: '09.11.2020'
  },
  {
    id: 3,
    title: 'Віртуальна бізнес-країна зі спеціальним правовим режимом для ІТ-компаній Дія.City запрацює у першій половині 2021 року',
    shortText: '«Наша амбітна мета — перше півріччя 2021 року, коли проєкт Дія.City запрацює, і будуть перші резиденти. Я вірю, що це прискорить у геометричній прогресії розвиток ІТ та креативної індустрії',
    text: [
      {
        content: [
          { sectionTitle: 'noneTitle' },
          { p: 'Про це повідомив віцепрем’єр-міністр – міністр цифрової трансформації Михайло Федоров у інтерв’ю НВ, повідомляє пресслужба Мінцифри в Телеграмі.' },
          { p: '«Наша амбітна мета — перше півріччя 2021 року, коли проєкт Дія.City запрацює, і будуть перші резиденти. Я вірю, що це прискорить у геометричній прогресії розвиток ІТ та креативної індустрії, а потім ми це масштабуємо на всю країну. Тобто глобальна наша мета — це зміна податкової системи в усій країні», – заявив Федоров.' },
          { p: 'Дія.City — це спеціальний правовий режим для IT-компаній. У Верховній Раді вже зареєстровано законопроєкти, що дозволять запустити Дія.City. ' },
          { p: 'За словами Михайла Федорова, Дія.City – це пілот для перезапуску всієї економіки України. За кілька років, після переведення усіх державних послуг в онлайн, таку податкову модель можна буде адаптувати на всю країну. ' },
          { p: 'Зокрема, за 5 років Дія.City дозволить збільшити об’єм ринку IT вдвічі — до $11,8 млрд, а кількість робочих місць до 450 тисяч.' },
          { p: 'Серед основних критеріїв вступу до Дія.City: ' },
          {
            ul: [
              'компанії мають належати за видом економічної діяльності до IT і креативної індустрії;',
              'штат компанії повинен налічувати мінімум дев’ять співробітників;',
              'середня заробітна плата має становити 1200 євро.'
            ]
          }
        ]
      }
    ],
    urlImage: imgArt3,
    urlImageWebp: imgArt3w,
    date: '15.10.2020'
  }
]

export { articles }
